In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
# Load excel file:
kpmg_data = 'C:/Users/user/Desktop/Data Science or Data Analytics/KPMG_VI_New_raw_data_update_final.xlsx'

# Read each sheet into separate Dataframe:
transc = pd.read_excel(kpmg_data, sheet_name = 'Transactions')
new_cust = pd.read_excel(kpmg_data, sheet_name = 'NewCustomerList')
cust_dem = pd.read_excel(kpmg_data, sheet_name = 'CustomerDemographic')
cust_addr = pd.read_excel(kpmg_data, sheet_name = 'CustomerAddress')

In [3]:
# Getting a brief summary of the data:

print(transc.info(verbose = False)) 
print(cust_dem.info(verbose = False))
print(cust_addr.info(verbose = False))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Columns: 13 entries, transaction_id to product_first_sold_date
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Columns: 13 entries, customer_id to tenure
dtypes: float64(1), int64(2), object(10)
memory usage: 406.4+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Columns: 6 entries, customer_id to property_valuation
dtypes: int64(3), object(3)
memory usage: 187.6+ KB
None

In [4]:
# Getting the list of indices:
print('Transaction data: ', transc.index)
print('Customer Demographic: ', cust_dem.index)
print('Customer Address: ', cust_addr.index)

Transaction data:  RangeIndex(start=0, stop=20000, step=1)
Customer Demographic:  RangeIndex(start=0, stop=4000, step=1)
Customer Address:  RangeIndex(start=0, stop=3999, step=1)

In [5]:
cust_dem.head(3)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0

In [6]:
cust_addr.head(3)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9

In [7]:
transc.head(3)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0

In [8]:
print("Number of unique customer IDs in Transaction data are: ", transc['customer_id'].nunique())
print("Number of unique customer IDs in Customer Demographic data are: ", cust_dem['customer_id'].nunique())
print("number of unique customer IDs in Customer Address are: ", cust_addr['customer_id'].nunique())

Number of unique customer IDs in Transaction data are:  3494
Number of unique customer IDs in Customer Demographic data are:  4000
number of unique customer IDs in Customer Address are:  3999

In [9]:

#           CHECKING FOR MISSING VALUES OR EMPTY ROWS

# Printing out the sum of all the missing values in the 3 datasets given:
print("Missing values in Transaction table:\n", transc.isnull().sum(), "\n")
print("Missing values in Customer Demographic:\n", cust_dem.isnull().sum(), "\n")
print("Missing values in Customer Address table:\n", cust_addr.isnull().sum(), "\n")

Missing values in Transaction table:
 transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

Missing values in Customer Demographic:
 customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

Missing values in Customer Address table:
 customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [10]:
# Perfoming a spellcheck:
# Use either 'pyspellchecker' or 'TextBlob' libraries
'''
from spellchecker import SpellChecker

spell = SpellChecker()   # Initialize the spell checker

names = cust_dem['first_name'].tolist()

misspelled = spell.unknown(names)


for word in misspelled:
    # Get the one 'most likely' answer
    correct_word = spell.correction(word)
    print(f"{word} -> {correct_word}")
    
    # Get a list of 'likely' options
    suggestions = spell.candidates(word)
    print(f"Suggestions for {word}: {suggestions}")
'''

'\nfrom spellchecker import SpellChecker\n\nspell = SpellChecker()   # Initialize the spell checker\n\nnames = cust_dem[\'first_name\'].tolist()\n\nmisspelled = spell.unknown(names)\n\n\nfor word in misspelled:\n    # Get the one \'most likely\' answer\n    correct_word = spell.correction(word)\n    print(f"{word} -> {correct_word}")\n    \n    # Get a list of \'likely\' options\n    suggestions = spell.candidates(word)\n    print(f"Suggestions for {word}: {suggestions}")\n'

In [15]:
# checking the datatypes
print("Custmer demographic datatypes: \n", cust_dem.dtypes, "\n")
print("Customer address datatypes: \n", cust_addr.dtypes, "\n")
print("Transaction datatypes: \n", transc.dtypes)

Custmer demographic datatypes:
 customer_id                              int64
first_name                              object
last_name                               object
gender                                  object
past_3_years_bike_related_purchases      int64
DOB                                     object
job_title                               object
job_industry_category                   object
wealth_segment                          object
deceased_indicator                      object
default                                 object
owns_car                                object
tenure                                 float64
dtype: object

Customer address datatypes:
 customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

Transaction datatypes:
 transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

In [12]:
# Checking for the most frequent job title :

common_job_title = cust_dem['job_title'].value_counts().idxmax()
common_job_title

'Business Systems Development Analyst'

In [13]:
# Checking for duplicates

columns_with_duplicates = {}

# Loop through each column to check for duplicates
for column in cust_dem.columns:
    if cust_dem[column].duplicated().any():
        # Store duplicate values
        columns_with_duplicates[column] = cust_dem[column][cust_dem[column].duplicated()]

# Print columns with duplicate values
for column, values in columns_with_duplicates.items():
    print(f"Column '{column}' has duplicate values:\n{values}\n")

Column 'first_name' has duplicate values:
61         Sorcha
95          Heath
146           Rea
167        Reggie
228        Vaughn
          ...
3992         Andi
3995      Rosalia
3996       Blanch
3998    Patrizius
3999        Kippy
Name: first_name, Length: 861, dtype: object

Column 'last_name' has duplicate values:
66                NaN
105               NaN
138               NaN
179           Neasham
196               NaN
            ...
3964           Dumphy
3976    Van der Beken
3985         Petrello
3996           Nisuis
3998              NaN
Name: last_name, Length: 274, dtype: object

Column 'gender' has duplicate values:
2         Male
3         Male
5         Male
6       Female
7         Male
         ...
3995    Female
3996    Female
3997         U
3998      Male
3999      Male
Name: gender, Length: 3994, dtype: object

Column 'past_3_years_bike_related_purchases' has duplicate values:
15      38
21      79
24      72
35      33
37      37
        ..
3995     8
3996    87
3997    60
3998    11
3999    76
Name: past_3_years_bike_related_purchases, Length: 3900, dtype: int64

Column 'DOB' has duplicate values:
167                     NaN
266                     NaN
289                     NaN
382     1978-07-15 00:00:00
408     1978-01-23 00:00:00
               ...
3979    1964-01-16 00:00:00
3980    1994-09-10 00:00:00
3995    1975-08-09 00:00:00
3997                    NaN
3998    1973-10-24 00:00:00
Name: DOB, Length: 551, dtype: object

Column 'job_title' has duplicate values:
5                         NaN
6                         NaN
10                        NaN
21                        NaN
22                        NaN
                ...
3995    VP Product Management
3996          Statistician II
3997        Assistant Manager
3998                      NaN
3999     Software Engineer IV
Name: job_title, Length: 3804, dtype: object

Column 'job_industry_category' has duplicate values:
6       Financial Services
7                      NaN
9       Financial Services
10                Property
12      Financial Services
               ...
3995                Health
3996         Manufacturing
3997                    IT
3998         Manufacturing
3999                   NaN
Name: job_industry_category, Length: 3990, dtype: object

Column 'wealth_segment' has duplicate values:
1           Mass Customer
2           Mass Customer
3           Mass Customer
6       Affluent Customer
7           Mass Customer
              ...
3995        Mass Customer
3996       High Net Worth
3997       High Net Worth
3998    Affluent Customer
3999    Affluent Customer
Name: wealth_segment, Length: 3997, dtype: object

Column 'deceased_indicator' has duplicate values:
1       N
2       N
3       N
4       N
5       N
       ..
3995    N
3996    N
3997    N
3998    N
3999    N
Name: deceased_indicator, Length: 3998, dtype: object

Column 'default' has duplicate values:
19                              ð©ð½
20                              -100
22               2018-02-01 00:00:00
32      <script>alert('hi')</script>
35                        <>?:"{}|_+
                    ...
3995                            -100
3996                        â¦testâ§
3997                             NaN
3998          Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ
3999                             0/0
Name: default, Length: 3909, dtype: object

Column 'owns_car' has duplicate values:
1       Yes
2       Yes
4       Yes
5       Yes
6       Yes
       ...
3995     No
3996    Yes
3997     No
3998    Yes
3999     No
Name: owns_car, Length: 3998, dtype: object

Column 'tenure' has duplicate values:
6       11.0
7        7.0
8        8.0
11       8.0
12       8.0
        ...
3995    19.0
3996     1.0
3997     NaN
3998    10.0
3999    11.0
Name: tenure, Length: 3977, dtype: float64

In [14]:
# Checking for whitespaces:
def check_whitespaces(cust_dem):
    for column in cust_dem.columns:
        if cust_dem[column].dtype == 'object': # checks only string columns
            whitespaces = cust_dem[column].apply(lambda x: x != x.strip() if isinstance(x, str) else False)
            if whitespaces.any():
                print(f"Column '{column}' has whitespaces in the following rows:")
                print(cust_dem[whitespaces])

# Run the function:
check_whitespaces(cust_dem)

Column 'default' has whitespaces in the following rows:
      customer_id first_name  last_name  gender  \
127           128     Isidro     Cypler    Male
133           134      Merna  McCulloch  Female
168           169       Alfy    Bruhnke    Male
216           217    Jeralee    Quartly  Female
283           284       Seth    Moorman    Male
...           ...        ...        ...     ...
3917         3918    Rosalia     Skedge  Female
3919         3920    Filbert   Deetlefs    Male
3992         3993       Andi    Dumelow  Female
3994         3995      Rusty     Iapico    Male
3998         3999  Patrizius        NaN    Male

      past_3_years_bike_related_purchases                  DOB  \
127                                    73  1977-07-17 00:00:00
133                                    34  1997-08-01 00:00:00
168                                    20  1957-10-19 00:00:00
216                                    63  1979-12-09 00:00:00
283                                    38  1986-04-11 00:00:00
...                                   ...                  ...
3917                                   52  1977-07-05 00:00:00
3919                                   90  1961-01-21 00:00:00
3992                                    6  1974-12-05 00:00:00
3994                                   93  1975-12-12 00:00:00
3998                                   11  1973-10-24 00:00:00

                      job_title job_industry_category     wealth_segment  \
127   Systems Administrator III              Property      Mass Customer
133             Legal Assistant    Telecommunications  Affluent Customer
168             Data Coordiator    Telecommunications     High Net Worth
216                         NaN         Manufacturing     High Net Worth
283           Financial Analyst    Financial Services     High Net Worth
...                         ...                   ...                ...
3917           Junior Executive                   NaN     High Net Worth
3919   Environmental Specialist    Telecommunications      Mass Customer
3992                  Librarian         Entertainment      Mass Customer
3994            Staff Scientist         Manufacturing      Mass Customer
3998                        NaN         Manufacturing  Affluent Customer

     deceased_indicator                 default owns_car  tenure
127                   N                      á       Yes    12.0
133                   N  Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes     5.0
168                   N  Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes     5.0
216                   N  Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ        No    16.0
283                   N  Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes     9.0
...                 ...                     ...      ...     ...
3917                  N                      á        No    18.0
3919                  N  Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes     9.0
3992                  N                      á        No    10.0
3994                  N                      á       Yes    14.0
3998                  N  Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes    10.0

[78 rows x 13 columns]

In [15]:
# Trim whitespaces from all string columns
# df_trimmed = df.apply(lambda x: x.str.strip() if x.dtype == "object" else x)

In [16]:
cust_dem.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13 00:00:00,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [20]:
cust_addr.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [22]:
# Checking for duplicates

cust_addr_duplicates = {}

# Loop through each column to check for duplicates
for column in cust_addr.columns:
    if cust_addr[column].duplicated().any():
        # Store duplicate values
        cust_addr_duplicates[column] = cust_addr[column][cust_addr[column].duplicated()]

# Print columns with duplicate values
for column, values in cust_addr_duplicates.items():
    print(f"Column '{column}' has duplicate values:\n{values}\n")

Column 'address' has duplicate values:
2470           3 Talisman Place
2980    3 Mariners Cove Terrace
3535     64 Macpherson Junction
Name: address, dtype: object

Column 'postcode' has duplicate values:
18      2650
19      2153
26      2135
44      2210
60      2153
        ...
3994    3064
3995    4511
3996    2756
3997    4032
3998    2251
Name: postcode, Length: 3126, dtype: int64

Column 'state' has duplicate values:
1       New South Wales
3       New South Wales
5       New South Wales
6       New South Wales
7       New South Wales
             ...
3994                VIC
3995                QLD
3996                NSW
3997                QLD
3998                NSW
Name: state, Length: 3994, dtype: object

Column 'country' has duplicate values:
1       Australia
2       Australia
3       Australia
4       Australia
5       Australia
          ...
3994    Australia
3995    Australia
3996    Australia
3997    Australia
3998    Australia
Name: country, Length: 3998, dtype: object

Column 'property_valuation' has duplicate values:
1       10
4        9
5        9
6        4
9        4
        ..
3994     3
3995     6
3996    10
3997     7
3998     7
Name: property_valuation, Length: 3987, dtype: int64

In [23]:
# Checking for whitespaces:
def check_whitespaces(cust_addr):
    for column in cust_addr.columns:
        if cust_addr[column].dtype == 'object': # checks only string columns
            whitespaces = cust_addr[column].apply(lambda x: x != x.strip() if isinstance(x, str) else False)
            if whitespaces.any():
                print(f"Column '{column}' has whitespaces in the following rows:")
                print(cust_addr[whitespaces])
            else:
                print("There are no whitespaces in this data")

# Run the function:
check_whitespaces(cust_addr)

There are no whitespaces in this data
There are no whitespaces in this data
There are no whitespaces in this data

In [26]:
transc.describe()

,transaction_id,product_id,customer_id,transaction_date,online_order,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,20000,19640.000000,20000.000000,19803.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,2017-07-01 14:08:05.280000,0.500458,1107.829449,556.046951,38199.776549
min,1.000000,0.00000,1.000000,2017-01-01 00:00:00,0.000000,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,2017-04-01 00:00:00,0.000000,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,2017-07-03 00:00:00,1.000000,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,2017-10-02 00:00:00,1.000000,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,2017-12-30 00:00:00,1.000000,2091.470000,1759.850000,42710.000000
std,5773.647028,30.75359,1011.951046,NaN,0.500013,582.825242,405.955660,2875.201110

In [28]:
# 'online_order' : 360 missing values
# 'Brand' : 197 missing values
# 'product_line' : 197 missing values
# 'product_class' : 197 missing values
# 'product_size' : 197 missing values
# 'product_cost' : 197 missing values
# 'product-first-sold-date : 197 missing values

In [29]:
# Checking for duplicates

transc_duplicates = {}

# Loop through each column to check for duplicates
for column in transc.columns:
    if transc[column].duplicated().any():
        # Store duplicate values
        transc_duplicates[column] = transc[column][transc[column].duplicated()]

# Print columns with duplicate values
for column, values in transc_duplicates.items():
    print(f"Column '{column}' has duplicate values:\n{values}\n")

Column 'product_id' has duplicate values:
14       12
15        3
19       25
21       37
22       37
         ..
19995    51
19996    41
19997    87
19998     6
19999    11
Name: product_id, Length: 19899, dtype: int64

Column 'customer_id' has duplicate values:
47       1305
82       3398
125       773
147      3262
148       788
         ...
19995    1018
19996     127
19997    2284
19998    2764
19999    1144
Name: customer_id, Length: 16506, dtype: int64

Column 'transaction_date' has duplicate values:
24      2017-06-11
56      2017-08-30
57      2017-11-14
61      2017-12-18
74      2017-06-20
           ...
19995   2017-06-24
19996   2017-11-09
19997   2017-04-14
19998   2017-07-03
19999   2017-09-22
Name: transaction_date, Length: 19636, dtype: datetime64[ns]

Column 'online_order' has duplicate values:
2        0.0
3        0.0
4        1.0
5        1.0
6        1.0
        ...
19995    1.0
19996    1.0
19997    1.0
19998    0.0
19999    1.0
Name: online_order, Length: 19997, dtype: float64

Column 'order_status' has duplicate values:
1        Approved
2        Approved
3        Approved
4        Approved
5        Approved
           ...
19995    Approved
19996    Approved
19997    Approved
19998    Approved
19999    Approved
Name: order_status, Length: 19998, dtype: object

Column 'brand' has duplicate values:
5        Giant Bicycles
7              WeareA2B
8                 Solex
9              WeareA2B
10        Trek Bicycles
              ...
19995        OHM Cycles
19996             Solex
19997        OHM Cycles
19998        OHM Cycles
19999     Trek Bicycles
Name: brand, Length: 19993, dtype: object

Column 'product_line' has duplicate values:
1        Standard
2        Standard
3        Standard
4        Standard
6        Standard
           ...
19995    Standard
19996        Road
19997    Standard
19998    Standard
19999    Standard
Name: product_line, Length: 19995, dtype: object

Column 'product_class' has duplicate values:
1        medium
3        medium
4        medium
5        medium
6        medium
          ...
19995      high
19996    medium
19997    medium
19998      high
19999    medium
Name: product_class, Length: 19996, dtype: object

Column 'product_size' has duplicate values:
2        medium
3        medium
4         large
5        medium
6        medium
          ...
19995    medium
19996    medium
19997    medium
19998    medium
19999     small
Name: product_size, Length: 19996, dtype: object

Column 'list_price' has duplicate values:
14       1765.30
15       2091.47
18       1292.84
19       1538.99
21       1793.43
          ...
19995    2005.66
19996     416.98
19997    1636.90
19998     227.88
19999    1775.81
Name: list_price, Length: 19704, dtype: float64

Column 'standard_cost' has duplicate values:
14        709.48
15        388.92
18         13.44
19        829.65
21        248.82
          ...
19995    1203.40
19996     312.74
19997      44.71
19998     136.73
19999    1580.47
Name: standard_cost, Length: 19896, dtype: float64

Column 'product_first_sold_date' has duplicate values:
18       39915.0
21       36361.0
25       42145.0
32       42404.0
39       38647.0
          ...
19995    37823.0
19996    35560.0
19997    40410.0
19998    38216.0
19999    36334.0
Name: product_first_sold_date, Length: 19899, dtype: float64

In [30]:
# Checking for whitespaces:
def whitespaces_transc(transc):
    for column in transc.columns:
        if transc[column].dtype == 'object': # checks only string columns
            whitespaces = transc[column].apply(lambda x: x != x.strip() if isinstance(x, str) else False)
            if whitespaces.any():
                print(f"Column '{column}' has whitespaces in the following rows:")
                print(transc[whitespaces])
            else:
                print("There are no whitespaces in this data")

# Run the function:
whitespaces_transc(transc)

There are no whitespaces in this data
There are no whitespaces in this data
There are no whitespaces in this data
There are no whitespaces in this data
There are no whitespaces in this data